recipes/japanese-curry.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Japanese curry</title>
<meta name="author" content="james" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content" class="content">
<h1 class="title">Japanese curry</h1>
<p>
<a href="https://www.okonomikitchen.com/vegan-japanese-curry/#tasty-recipes-13106-jump-target">Original link</a>
</p>

<div id="outline-container-org60fbfa7" class="outline-2">
<h2 id="org60fbfa7">Ingredients</h2>
<div class="outline-text-2" id="text-org60fbfa7">
</div>
<div id="outline-container-orga35870b" class="outline-3">
<h3 id="orga35870b">For the Curry</h3>
<div class="outline-text-3" id="text-orga35870b">
<ul class="org-ul">
<li>1 large (300 g) onion, sliced into wedges</li>
<li>2 garlic cloves, grated</li>
<li>2 tsp ginger, grated</li>
<li>½ (150 g) package mushrooms</li>
<li>1 (150 g) carrot, cut into wedges</li>
<li>2-3 (250 g) potatoes</li>
<li>¾ cup (60 g) soy curls</li>
<li>½ (100 g) apple, grated</li>
<li>2 ½ cup (625 ml) water</li>
<li>½ box (120 g) curry roux cubes (or about 240-270g homemade curry cubes)</li>
<li>Salt and pepper to taste</li>
</ul>
</div>
</div>

<div id="outline-container-orgd9ae884" class="outline-3">
<h3 id="orgd9ae884">Kakushi aji (hidden flavours)</h3>
<div class="outline-text-3" id="text-orgd9ae884">
<ul class="org-ul">
<li>⅓ cup (100 g) caramelized onions (see recipe below)</li>
<li>1 tbsp Japanese Worcester or Tonkatsu sauce (15ml)</li>
<li>1 tbsp ketchup (15ml)</li>
<li>1 tbsp soy sauce (15ml // tamari for gluten free)</li>
<li>1 tbsp sugar of choice (14g)</li>
<li>1 tsp cocoa powder (3g)</li>
<li>1 tsp instant coffee (3g)</li>
</ul>
</div>
</div>

<div id="outline-container-org00dc4d2" class="outline-3">
<h3 id="org00dc4d2">Caramelized onions</h3>
<div class="outline-text-3" id="text-org00dc4d2">
<ul class="org-ul">
<li>1 large (300 g) onion</li>
<li>1 tbsp (15 g) vegan butter</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2383ccf" class="outline-2">
<h2 id="org2383ccf">Instructions</h2>
<div class="outline-text-2" id="text-org2383ccf">
</div>
<div id="outline-container-org185caee" class="outline-3">
<h3 id="org185caee">Curry</h3>
<div class="outline-text-3" id="text-org185caee">
<ol class="org-ol">
<li>Over medium high heat, add onions and fry for 1 minute. Add in garlic and ginger and fry for another minute. Add in the mushrooms, carrots, potatoes and soy curls, and cook for 5 minutes.</li>
<li>Add water and grated apple. Bring to a boil and then reduce heat to a low and simmer for 15 minutes or until you can pierce a toothpick through it.</li>
<li>Turn off the heat. Chop up the roux into small pieces (makes it easier to dissolve). Add the chopped roux to a soup ladle and dissolve it well into the curry. Stir in kakushi aji mixture. Add any other kakushiaji.</li>
<li>Turn heat to low and simmer to thicken, about 5 minutes. 
Serve over rice and enjoy!</li>
</ol>
</div>
</div>

<div id="outline-container-org0d90ac1" class="outline-3">
<h3 id="org0d90ac1">Caramelized onions</h3>
<div class="outline-text-3" id="text-org0d90ac1">
<ol class="org-ol">
<li>Thinly slice the onions.</li>
<li>Heat butter in a medium pan over medium heat until melted. Stir the onions until softened and become translucent.</li>
<li>Reduce heat to medium low and continue to cook, stirring every few minutes to prevent them from sticking and burning until light amber (about 20 minutes). Continue to caramelize until golden brown. If at any point it looks like the pan is burning, add a splash of water to deglaze the pan.</li>
<li>You can stop here at the point where they are soft and jammy or continue to cook for another 10 minutes until slightly blackened around the edges</li>
</ol>
</div>
</div>
</div>
</div>
</body>
</html>
